var t = function(t) {
    return (t = t.toString())[1] ? t : "0" + t;
}, e = [ "铲屎的，我今天心情不错哦~快来撸毛吧！", "朕很不高兴，铲屎的为什么不给朕喂饭！为什么还不铲屎！", "你不要往前！朕很害怕你！很讨厌你！你再往前小心朕的组合拳！", "咦？铲屎的，你拿的是什么？", "朕对铲屎的你非常满意哦~表现的不错值得朕的宠幸。", "求摸摸~求抱抱~", "铲屎的我觉得我需要一个女朋友！", "你一定是个好主人，鉴定完毕~", "再摸摸我吧~", "快来陪我玩啊！", "我是真的在等着你回家呢~", "你给我带吃的了吗~？", "骚年，老老实实给你家猫主子铲一辈子屎吧！", "come on~baby~！", "你肿么啦？", "这是我的，这也是我的，都是我的！", "你是我的麻麻！", "铲屎的，寡人舔的这么累，还不来帮忙！", "你好哟~", "我们一起睡觉觉吧~", "给我食物了啦", "不要伤害我！", "哈哈，被我发现了吧！", "本主公不明白呢？", "别过来，不然我攻击你！", "你吓到本主公了！", "咱们两个谈谈吧？", "你会说我们的话？", "你的发音已经无药可救了，放弃治疗吧，少年", "愚蠢，不是这么叫的，跟我叫，喵", "心情不错，但是还不是很满足。", "不要！", "主人，我来安慰你....", "来和我一起玩捕猎的游戏！", "我没脸见人啦！", "我在巡逻领地！", "似乎闻到了吃的东西！" ], o = [ "太高兴了！", "我是麻麻的最爱！", "我很友好的。", "你好呀，我喜欢你。", "快点给我吃饭饭吧。", "喂，别靠近我啊！", "我想与你在一起。", "我饿了，给我一根香肠吃喝。", "你是我的老板，你看我多弱小啊。", "识相点，别把老子逼急了！", "我做错事了，我好害怕啊。。。。。。", "你看，我在保护你，我的警惕性多高啊！", "人类真复杂，总是做我不明白的事情。", "哪里跑，小子，今天就是你的忌日。", "我很烦，快来哄哄我！", "我讨厌你这条臭狗，快滚开你。", "孤独啊，还有点肚子痛，麻麻！", "粑粑麻麻，有件事情想和你们商量下。", "我可不想惹麻烦。", "我们来做游戏吧！", "我有点生气了。", "这是我的领地，我来过这里！", "家里你是老大，我是老二。", "有人在那儿吗？我很孤单，我需要有个伙伴！", "我想静静。", "求求你好不好？", "我饿了，把我的粮食端上来。", "超级high，我们一起摇摆。", "我很生气，要咬你了！", "我不想惹你生气，请接收我的道歉吧！", "来吧，摸摸我的肚皮！", "我会乖乖听话的。", "带我一起去散步吧！" ], i = [ "公猫发情", "发凶低吼", "可爱猫叫", "吵架", "奶声奶气", "奶猫尖叫", "奶猫长叫", "小猫叫", "山猫叫", "很委屈", "打呼", "撒娇", "猫呼噜", "猫咆哮", "猫哀嚎叫", "猫哀怨", "猫喝水", "猫怨气", "猫打架", "猫饥饿", "生无可恋", "老猫叫", "野猫发凶", "野猫叫", "饥饿" ], n = [ "不服就干", "凶猛的狗", "刚出生", "呼朋唤友", "回应好友", "大喘粗气", "大狼狗", "奶狗叫", "奶狗嚎叫", "学狼叫", "小型犬叫", "小狗发凶", "小狗吠叫", "小狗呜咽", "小狗哀嚎", "很委屈", "狗三连叫", "狗低吼", "狗吠叫", "狗咆哮", "狗威胁", "狗宝宝", "狗愤怒", "狗狗的警告", "狗震慑", "看门狗叫声", "萨摩耶", "藏獒叫", "金毛叫声" ];

module.exports = {
    formatTime: function(e) {
        var o = e.getFullYear(), i = e.getMonth() + 1, n = e.getDate(), a = e.getHours(), r = e.getMinutes(), s = e.getSeconds();
        return [ o, i, n ].map(t).join("/") + " " + [ a, r, s ].map(t).join(":");
    },
    catSaysList: e,
    dogSaysList: o,
    dogVoiceList: n,
    catVoiceList: i
};